#+TITLE: DEV NOTEBOOK - README
#+AUTHOR: Benjamin
#+EMAIL: b3nj4m1n@gmx.net
#+LANGUAGE: en

This is a generalised example of what an entry for a language should look like.

When something is written in all caps, that means its a variable which should be replaced.

**** Write to stdout :write:stdout:
#+begin_src LANG :results output :exports both :wrap example
# CODE
#+end_src

#+RESULTS:
#+begin_example
Output
#+end_example

**** Check if substring is contained :contained:
#+begin_src LANG :results output :exports both :wrap example
# CODE
#+end_src

#+RESULTS:
#+begin_example
Output
#+end_example
**** Concatenate two strings :concat:
#+begin_src LANG :results output :exports both :wrap example
# CODE
#+end_src

#+RESULTS:
#+begin_example
Output
#+end_example
**** Compare with other string :compare:
#+begin_src LANG :results output :exports both :wrap example
# CODE
#+end_src

#+RESULTS:
#+begin_example
Output
#+end_example
**** Convert to Lowercase/Uppercase :lowercase:uppercase:
#+begin_src LANG :results output :exports both :wrap example
# CODE
#+end_src

#+RESULTS:
#+begin_example
Output
#+end_example
**** Get char at index :index:
#+begin_src LANG :results output :exports both :wrap example
# CODE
#+end_src

#+RESULTS:
#+begin_example
Output
#+end_example
**** Get length :length:
#+begin_src LANG :results output :exports both :wrap example
# CODE
#+end_src

#+RESULTS:
#+begin_example
Output
#+end_example
**** Is equal to other string :equal:
#+begin_src LANG :results output :exports both :wrap example
# CODE
#+end_src

#+RESULTS:
#+begin_example
Output
#+end_example
**** Replace substring with string :replace:
#+begin_src LANG :results output :exports both :wrap example
# CODE
#+end_src

#+RESULTS:
#+begin_example
Output
#+end_example
**** Reverse :reverse:
#+begin_src LANG :results output :exports both :wrap example
# CODE
#+end_src

#+RESULTS:
#+begin_example
Output
#+end_example
**** Split by delimiter :split:
#+begin_src LANG :results output :exports both :wrap example
# CODE
#+end_src

#+RESULTS:
#+begin_example
Output
#+end_example
**** Strip whitespace :strip:
#+begin_src LANG :results output :exports both :wrap example
# CODE
#+end_src

#+RESULTS:
#+begin_example
Output
#+end_example
**** For-each Loop :for_each:
#+begin_src LANG :results output :exports both :wrap example
# CODE
#+end_src

#+RESULTS:
#+begin_example
Output
#+end_example
**** For Loop :for:
#+begin_src LANG :results output :exports both :wrap example
# CODE
#+end_src

#+RESULTS:
#+begin_example
Output
#+end_example
**** If, else if, else :if:else_if:else:
#+begin_src LANG :results output :exports both :wrap example
# CODE
#+end_src

#+RESULTS:
#+begin_example
Output
#+end_example
**** While Loop :while:
#+begin_src LANG :results output :exports both :wrap example
# CODE
#+end_src

#+RESULTS:
#+begin_example
Output
#+end_example
**** Call Function
#+begin_src LANG :session function_example :results output :exports both :wrap example
# CODE
#+end_src

#+RESULTS:
#+begin_example
Output
#+end_example
***** Use
#+begin_src LANG :session array_example :results output :exports both :wrap example
# CODE
#+end_src

#+RESULTS:
#+begin_example
Output
#+end_example
***** Use
#+begin_src LANG :session list_example :results output :exports both :wrap example
# CODE
#+end_src

#+RESULTS:
#+begin_example
Output
#+end_example
***** Use
#+begin_src LANG :session record_example :results output :exports both :wrap example
# CODE
#+end_src

#+RESULTS:
#+begin_example
Output
#+end_example
***** Use
#+begin_src LANG :session union_example :results output :exports both :wrap example
# CODE
#+end_src

#+RESULTS:
#+begin_example
Output
#+end_example
***** Use
#+begin_src LANG :session dict_example :results output :exports both :wrap example
# CODE
#+end_src

#+RESULTS:
#+begin_example
Output
#+end_example
**** Error :error:
#+begin_src LANG :results output :exports both :wrap example
# CODE
#+end_src

#+RESULTS:
#+begin_example
Output
#+end_example
**** Solution :solution:
#+begin_src LANG :results output :exports both :wrap example
# CODE
#+end_src

#+RESULTS:
#+begin_example
Output
#+end_example
****** SNIPPET 1 TITLE :snippet_1_title:
#+begin_src LANG :results output :exports both :wrap example
# CODE
#+end_src

#+RESULTS:
#+begin_example
Output
#+end_example
****** Error :error:
#+begin_src LANG :results output :exports both :wrap example
# CODE
#+end_src

#+RESULTS:
#+begin_example
Output
#+end_example
****** Solution :solution:
#+begin_src LANG :results output :exports both :wrap example
# CODE
#+end_src

#+RESULTS:
#+begin_example
Output
#+end_example
